__________________________________________________________________________________________________
Layer (type)                    Output Shape         Param #     Connected to                     
==================================================================================================
input_21 (InputLayer)           (None, 20, 256, 256, 0                                            
__________________________________________________________________________________________________
td_Stem (TimeDistributed)       (None, 20, 32, 32, 5 1039488     input_21[0][0]                   
__________________________________________________________________________________________________
td_rBlock1 (TimeDistributed)    (None, 20, 32, 32, 5 1312128     td_Stem[0][0]                    
__________________________________________________________________________________________________
td_Model1 (TimeDistributed)     (None, 20, 32, 32, 1 5978304     td_rBlock1[0][0]                 
__________________________________________________________________________________________________
lambda_26 (Lambda)              (None, 20, 32, 32, 8 0           td_Model1[0][0]                  
__________________________________________________________________________________________________
lambda_27 (Lambda)              (None, 20, 32, 32, 2 0           lambda_26[0][0]                  
__________________________________________________________________________________________________
lambda_28 (Lambda)              (None, 20, 8, 20)    0           lambda_26[0][0]                  
__________________________________________________________________________________________________
td_GlobalMaxPooling2D (TimeDist (None, 20, 20)       0           lambda_27[0][0]                  
__________________________________________________________________________________________________
td_GlobalMaxPooling1D (TimeDist (None, 20, 20)       0           lambda_28[0][0]                  
__________________________________________________________________________________________________
add_48 (Add)                    (None, 20, 20)       0           td_GlobalMaxPooling2D[0][0]      
                                                                 td_GlobalMaxPooling1D[0][0]      
__________________________________________________________________________________________________
sSAM (TimeDistributed)          (None, 20, 20, 2)    41760       lambda_27[0][0]                  
__________________________________________________________________________________________________
zSAM (TimeDistributed)          (None, 20, 20, 1)    3200        lambda_28[0][0]                  
__________________________________________________________________________________________________
lambda_29 (Lambda)              (None, 20, 20, 1)    0           add_48[0][0]                     
__________________________________________________________________________________________________
td_ChannelSoftmax (TimeDistribu (None, 20, 32, 32, 2 0           lambda_27[0][0]                  
__________________________________________________________________________________________________
concatenate_9 (Concatenate)     (None, 20, 20, 3)    0           sSAM[0][0]                       
                                                                 zSAM[0][0]                       
__________________________________________________________________________________________________
activation_29 (Activation)      (None, 20, 20, 1)    0           lambda_29[0][0]                  
__________________________________________________________________________________________________
Kronecker_prod (Lambda)         (None, 20, 20, 576)  0           td_ChannelSoftmax[0][0]          
                                                                 td_rBlock1[0][0]                 
__________________________________________________________________________________________________
PoseAR (Model)                  [(None, 5, 5, 60), ( 3810464     concatenate_9[0][0]              
                                                                 activation_29[0][0]              
__________________________________________________________________________________________________
GuidedVisAR (Model)             [(None, 5, 5, 60), ( 4795904     Kronecker_prod[0][0]             
__________________________________________________________________________________________________
separable_conv2d_5 (SeparableCo (None, 5, 5, 60)     3660        PoseAR[1][3]                     
__________________________________________________________________________________________________
separable_conv2d_6 (SeparableCo (None, 5, 5, 60)     3660        GuidedVisAR[1][3]                
__________________________________________________________________________________________________
add_63 (Add)                    (None, 5, 5, 60)     0           separable_conv2d_5[0][0]         
                                                                 separable_conv2d_6[0][0]         
__________________________________________________________________________________________________
GlobalMaxMinPooling2D_0 (Lambda (None, 60)           0           PoseAR[1][0]                     
__________________________________________________________________________________________________
GlobalMaxMinPooling2D_1 (Lambda (None, 60)           0           PoseAR[1][1]                     
__________________________________________________________________________________________________
GlobalMaxMinPooling2D_2 (Lambda (None, 60)           0           PoseAR[1][2]                     
__________________________________________________________________________________________________
GlobalMaxMinPooling2D_3 (Lambda (None, 60)           0           PoseAR[1][3]                     
__________________________________________________________________________________________________
GlobalMaxMinPooling2D_4 (Lambda (None, 60)           0           GuidedVisAR[1][0]                
__________________________________________________________________________________________________
GlobalMaxMinPooling2D_5 (Lambda (None, 60)           0           GuidedVisAR[1][1]                
__________________________________________________________________________________________________
GlobalMaxMinPooling2D_6 (Lambda (None, 60)           0           GuidedVisAR[1][2]                
__________________________________________________________________________________________________
GlobalMaxMinPooling2D_7 (Lambda (None, 60)           0           GuidedVisAR[1][3]                
__________________________________________________________________________________________________
GlobalMaxMinPooling2D_8 (Lambda (None, 60)           0           add_63[0][0]                     
__________________________________________________________________________________________________
p1 (Activation)                 (None, 60)           0           GlobalMaxMinPooling2D_0[0][0]    
__________________________________________________________________________________________________
p2 (Activation)                 (None, 60)           0           GlobalMaxMinPooling2D_1[0][0]    
__________________________________________________________________________________________________
p3 (Activation)                 (None, 60)           0           GlobalMaxMinPooling2D_2[0][0]    
__________________________________________________________________________________________________
p4 (Activation)                 (None, 60)           0           GlobalMaxMinPooling2D_3[0][0]    
__________________________________________________________________________________________________
v1 (Activation)                 (None, 60)           0           GlobalMaxMinPooling2D_4[0][0]    
__________________________________________________________________________________________________
v2 (Activation)                 (None, 60)           0           GlobalMaxMinPooling2D_5[0][0]    
__________________________________________________________________________________________________
v3 (Activation)                 (None, 60)           0           GlobalMaxMinPooling2D_6[0][0]    
__________________________________________________________________________________________________
v4 (Activation)                 (None, 60)           0           GlobalMaxMinPooling2D_7[0][0]    
__________________________________________________________________________________________________
m (Activation)                  (None, 60)           0           GlobalMaxMinPooling2D_8[0][0]    
==================================================================================================
Total params: 16,988,568
Trainable params: 8,599,976
Non-trainable params: 8,388,592
__________________________________________________________________________________________________
