__________________________________________________________________________________________________
Layer (type)                    Output Shape         Param #     Connected to                     
==================================================================================================
input_1 (InputLayer)            (None, 256, 256, 3)  0                                            
__________________________________________________________________________________________________
Stem (Model)                    (None, 32, 32, 576)  1039488     input_1[0][0]                    
__________________________________________________________________________________________________
rBlock1 (Model)                 (None, 32, 32, 576)  1312128     Stem[1][0]                       
__________________________________________________________________________________________________
SepConv1 (Model)                (None, 32, 32, 576)  347904      rBlock1[1][0]                    
__________________________________________________________________________________________________
RegMap1 (Model)                 (None, 32, 32, 160)  92160       SepConv1[1][0]                   
__________________________________________________________________________________________________
fReMap1 (Model)                 (None, 32, 32, 576)  93888       RegMap1[1][0]                    
__________________________________________________________________________________________________
add_12 (Add)                    (None, 32, 32, 576)  0           rBlock1[1][0]                    
                                                                 SepConv1[1][0]                   
                                                                 fReMap1[1][0]                    
__________________________________________________________________________________________________
rBlock2 (Model)                 (None, 32, 32, 576)  1312128     add_12[0][0]                     
__________________________________________________________________________________________________
SepConv2 (Model)                (None, 32, 32, 576)  347904      rBlock2[1][0]                    
__________________________________________________________________________________________________
RegMap2 (Model)                 (None, 32, 32, 160)  92160       SepConv2[1][0]                   
__________________________________________________________________________________________________
fReMap2 (Model)                 (None, 32, 32, 576)  93888       RegMap2[1][0]                    
__________________________________________________________________________________________________
add_23 (Add)                    (None, 32, 32, 576)  0           rBlock2[1][0]                    
                                                                 SepConv2[1][0]                   
                                                                 fReMap2[1][0]                    
__________________________________________________________________________________________________
rBlock3 (Model)                 (None, 32, 32, 576)  1312128     add_23[0][0]                     
__________________________________________________________________________________________________
SepConv3 (Model)                (None, 32, 32, 576)  347904      rBlock3[1][0]                    
__________________________________________________________________________________________________
RegMap3 (Model)                 (None, 32, 32, 160)  92160       SepConv3[1][0]                   
__________________________________________________________________________________________________
fReMap3 (Model)                 (None, 32, 32, 576)  93888       RegMap3[1][0]                    
__________________________________________________________________________________________________
add_34 (Add)                    (None, 32, 32, 576)  0           rBlock3[1][0]                    
                                                                 SepConv3[1][0]                   
                                                                 fReMap3[1][0]                    
__________________________________________________________________________________________________
rBlock4 (Model)                 (None, 32, 32, 576)  1312128     add_34[0][0]                     
__________________________________________________________________________________________________
SepConv4 (Model)                (None, 32, 32, 576)  347904      rBlock4[1][0]                    
__________________________________________________________________________________________________
RegMap4 (Model)                 (None, 32, 32, 160)  92160       SepConv4[1][0]                   
__________________________________________________________________________________________________
lambda_10 (Lambda)              (None, 32, 32, 8, 20 0           RegMap1[1][0]                    
__________________________________________________________________________________________________
lambda_14 (Lambda)              (None, 32, 32, 8, 20 0           RegMap2[1][0]                    
__________________________________________________________________________________________________
lambda_18 (Lambda)              (None, 32, 32, 8, 20 0           RegMap3[1][0]                    
__________________________________________________________________________________________________
lambda_22 (Lambda)              (None, 32, 32, 8, 20 0           RegMap4[1][0]                    
__________________________________________________________________________________________________
lambda_11 (Lambda)              (None, 32, 32, 20)   0           lambda_10[0][0]                  
__________________________________________________________________________________________________
lambda_12 (Lambda)              (None, 8, 20)        0           lambda_10[0][0]                  
__________________________________________________________________________________________________
lambda_15 (Lambda)              (None, 32, 32, 20)   0           lambda_14[0][0]                  
__________________________________________________________________________________________________
lambda_16 (Lambda)              (None, 8, 20)        0           lambda_14[0][0]                  
__________________________________________________________________________________________________
lambda_19 (Lambda)              (None, 32, 32, 20)   0           lambda_18[0][0]                  
__________________________________________________________________________________________________
lambda_20 (Lambda)              (None, 8, 20)        0           lambda_18[0][0]                  
__________________________________________________________________________________________________
lambda_23 (Lambda)              (None, 32, 32, 20)   0           lambda_22[0][0]                  
__________________________________________________________________________________________________
lambda_24 (Lambda)              (None, 8, 20)        0           lambda_22[0][0]                  
__________________________________________________________________________________________________
global_max_pooling2d_2 (GlobalM (None, 20)           0           lambda_11[0][0]                  
__________________________________________________________________________________________________
global_max_pooling1d_1 (GlobalM (None, 20)           0           lambda_12[0][0]                  
__________________________________________________________________________________________________
global_max_pooling2d_3 (GlobalM (None, 20)           0           lambda_15[0][0]                  
__________________________________________________________________________________________________
global_max_pooling1d_2 (GlobalM (None, 20)           0           lambda_16[0][0]                  
__________________________________________________________________________________________________
global_max_pooling2d_4 (GlobalM (None, 20)           0           lambda_19[0][0]                  
__________________________________________________________________________________________________
global_max_pooling1d_3 (GlobalM (None, 20)           0           lambda_20[0][0]                  
__________________________________________________________________________________________________
global_max_pooling2d_5 (GlobalM (None, 20)           0           lambda_23[0][0]                  
__________________________________________________________________________________________________
global_max_pooling1d_4 (GlobalM (None, 20)           0           lambda_24[0][0]                  
__________________________________________________________________________________________________
add_11 (Add)                    (None, 20)           0           global_max_pooling2d_2[0][0]     
                                                                 global_max_pooling1d_1[0][0]     
__________________________________________________________________________________________________
add_22 (Add)                    (None, 20)           0           global_max_pooling2d_3[0][0]     
                                                                 global_max_pooling1d_2[0][0]     
__________________________________________________________________________________________________
add_33 (Add)                    (None, 20)           0           global_max_pooling2d_4[0][0]     
                                                                 global_max_pooling1d_3[0][0]     
__________________________________________________________________________________________________
add_44 (Add)                    (None, 20)           0           global_max_pooling2d_5[0][0]     
                                                                 global_max_pooling1d_4[0][0]     
__________________________________________________________________________________________________
sSAM (Model)                    (None, 20, 2)        41760       lambda_11[0][0]                  
                                                                 lambda_15[0][0]                  
                                                                 lambda_19[0][0]                  
                                                                 lambda_23[0][0]                  
__________________________________________________________________________________________________
zSAM (Model)                    (None, 20, 1)        3200        lambda_12[0][0]                  
                                                                 lambda_16[0][0]                  
                                                                 lambda_20[0][0]                  
                                                                 lambda_24[0][0]                  
__________________________________________________________________________________________________
lambda_13 (Lambda)              (None, 20, 1)        0           add_11[0][0]                     
__________________________________________________________________________________________________
lambda_17 (Lambda)              (None, 20, 1)        0           add_22[0][0]                     
__________________________________________________________________________________________________
lambda_21 (Lambda)              (None, 20, 1)        0           add_33[0][0]                     
__________________________________________________________________________________________________
lambda_25 (Lambda)              (None, 20, 1)        0           add_44[0][0]                     
__________________________________________________________________________________________________
concatenate_5 (Concatenate)     (None, 20, 3)        0           sSAM[1][0]                       
                                                                 zSAM[1][0]                       
__________________________________________________________________________________________________
activation_13 (Activation)      (None, 20, 1)        0           lambda_13[0][0]                  
__________________________________________________________________________________________________
concatenate_6 (Concatenate)     (None, 20, 3)        0           sSAM[2][0]                       
                                                                 zSAM[2][0]                       
__________________________________________________________________________________________________
activation_18 (Activation)      (None, 20, 1)        0           lambda_17[0][0]                  
__________________________________________________________________________________________________
concatenate_7 (Concatenate)     (None, 20, 3)        0           sSAM[3][0]                       
                                                                 zSAM[3][0]                       
__________________________________________________________________________________________________
activation_23 (Activation)      (None, 20, 1)        0           lambda_21[0][0]                  
__________________________________________________________________________________________________
concatenate_8 (Concatenate)     (None, 20, 3)        0           sSAM[4][0]                       
                                                                 zSAM[4][0]                       
__________________________________________________________________________________________________
activation_28 (Activation)      (None, 20, 1)        0           lambda_25[0][0]                  
==================================================================================================
Total params: 8,374,880
Trainable params: 5,949,504
Non-trainable params: 2,425,376
__________________________________________________________________________________________________
